Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.Info1 Property
 The Info 1 field of the ProjectInfo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Info1 { get; set; }
Public Property Info1 As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace